fonecmid-diplom/src/Documents/ВКМ_ГрафикиОтпусков/ВКМ_ГрафикиОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикиОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ПлановыеОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПревышенаДлительность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ПлановыеОтпуска/ВКМ_ПлановыеОтпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ПлановыеОтпуска</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ДнейОтпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикиОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ВКМ_ПлановыеОтпуска.Записывать = Истина;

	ТаблицаОтпусков = ОтпускаСотрудников.Выгрузить(,"Сотрудник, ПродолжительностьОтпуска");
	ТаблицаОтпусков.Свернуть("Сотрудник","ПродолжительностьОтпуска");

	Для Каждого Строка Из ТаблицаОтпусков Цикл

		Если Не ЗначениеЗаполнено(Строка.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.ВКМ_ПлановыеОтпуска.Добавить();

		Движение.Период = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Год = Год;
		Движение.ДнейОтпуска = Строка.ПродолжительностьОтпуска;

	КонецЦикла;

	Движения.ВКМ_ПлановыеОтпуска.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
